SSD_Test_Results/Fio_Results/random_write_info.txt
Random_Write_Info
========================================
[sudo] password for vamsimikkii: rand_write: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=1
...
fio-3.36
Starting 4 processes
rand_write: Laying out IO file (1 file / 1024MiB)
rand_write: Laying out IO file (1 file / 1024MiB)
rand_write: Laying out IO file (1 file / 1024MiB)
[...]

rand_write: (groupid=0, jobs=4): err= 0: pid=166105: Mon Nov 25 17:20:03 2024
  write: IOPS=673k, BW=2627MiB/s (2755MB/s)(4096MiB/1559msec); 0 zone resets
    slat (usec): min=2, max=1870, avg= 4.15, stdev=10.44
    clat (nsec): min=554, max=232508, avg=772.12, stdev=657.81
     lat (usec): min=2, max=1873, avg= 4.92, stdev=10.56
    clat percentiles (nsec):
     |  1.00th=[  572],  5.00th=[  572], 10.00th=[  572], 20.00th=[  580],
     | 30.00th=[  580], 40.00th=[  596], 50.00th=[  604], 60.00th=[  660],
     | 70.00th=[  756], 80.00th=[  916], 90.00th=[ 1096], 95.00th=[ 1496],
     | 99.00th=[ 1832], 99.50th=[ 2480], 99.90th=[ 3856], 99.95th=[ 6304],
     | 99.99th=[14656]
   bw (  MiB/s): min= 2427, max= 3492, per=100.00%, avg=2954.45, stdev=133.25, samples=9
   iops        : min=621344, max=893994, avg=756339.00, stdev=34111.36, samples=9
  lat (nsec)   : 750=69.75%, 1000=16.91%
  lat (usec)   : 2=12.59%, 4=0.65%, 10=0.08%, 20=0.02%, 50=0.01%
  lat (usec)   : 100=0.01%, 250=0.01%
  cpu          : usr=22.86%, sys=76.90%, ctx=144, majf=0, minf=49
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,1048576,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
  WRITE: bw=2627MiB/s (2755MB/s), 2627MiB/s-2627MiB/s (2755MB/s-2755MB/s), io=4096MiB (4295MB), run=1559-1559msec

Disk stats (read/write):
  nvme0n1: ios=0/25857, sectors=0/1360944, merge=0/11, ticks=0/17338, in_queue=17338, util=14.80%